tutorials/multicomponentFluid/shearlayer_DLB/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

refmapping
{
    active          true;
    mixtureFractionProperties
    {
        oxidizerMassFractions
        {
            N2              0.77;
            O2              0.23;
        }
        fuelMassFractions
        {
            NC12H26           1;
        }
        #include "$FOAM_CASE/constant/foam/thermo.foam"
    }
    tolerance       0.0001;
}

chemistry       on;

initialChemicalTimeStep 1;

loadbalancing
{
	active	true;
	log	true;
}

chemistryType
{
    solver          ode;
    method          loadBalanced;
}

odeCoeffs
{
    solver          seulex;
    absTol          1e-08;
    relTol          1e-05;
}

#include "$FOAM_CASE/constant/reactionsYao"
// ************************************************************************* //
