tutorials/multicomponentFluid/shearlayer_DLB/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | DLBFoam: Dynamic Load Balancing                 |
|  \\    /   O peration     | for fast reactive simulations                   |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  | 2020, Aalto University, Finland                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 4;

method          scotch;

// ************************************************************************* //
